; domain
(define (domain myDomain)
(:requirements :strips :equality :typing)
(:types 
Service - Thing
Capability
Object - Thing
Location
Boolean
State
ServiceCooler ServiceHeater ServiceRobot2 ServiceProcessor ServiceRobot1 ServiceConverter - Service
)
(:predicates 
(provides ?srv - Service ?c - Capability) 
(heated ?o - Object ?b - Boolean)
(processed ?o - Object ?b - Boolean)
(cooled ?o - Object ?b - Boolean)
(movable ?o - Object ?b - Boolean)
(loaded ?o - Object ?b - Boolean)
(at ?o - Object ?l - Location)
(at ?s - Service ?l - Location)
(status ?s - Service ?s - State)
)
(:functions (total-cost))
(:action cool
:parameters (?srv - ServiceCooler ?o - Object ?l - Location)
:precondition (and (provides ?srv cooling) (loaded ?o false) (processed ?o true) (cooled ?o false) (at ?o ?l) (at ?srv ?l) (status ?srv available) )
:effect (and (cooled ?o true) (not(cooled ?o false)) (increase (total-cost) 1))
)
(:action heat
:parameters (?srv - ServiceHeater ?o - Object ?l - Location)
:precondition (and (provides ?srv heating) (loaded ?o false) (heated ?o false) (at ?o ?l) (at ?srv ?l) (status ?srv available) )
:effect (and (heated ?o true) (not(heated ?o false)) (increase (total-cost) 1))
)
(:action load2
:parameters (?srv - ServiceRobot2 ?o - Object ?l - Location)
:precondition (and (provides ?srv loading) (loaded ?o false) (at ?o ?l) (at ?srv ?l) (status ?srv available) )
:effect (and (loaded ?o true) (not(loaded ?o false)) (increase (total-cost) 1))
)
(:action unload2
:parameters (?srv - ServiceRobot2 ?o - Object ?l - Location)
:precondition (and (provides ?srv unloading) (loaded ?o true) (movable ?o true) (at ?srv ?l) (status ?srv available) )
:effect (and (loaded ?o false) (at ?o ?l) (not(loaded ?o true)) (increase (total-cost) 1))
)
(:action move2
:parameters (?srv - ServiceRobot2 ?l1 - Location ?l2 - Location)
:precondition (and (provides ?srv moving) (at ?srv ?l1) (status ?srv available) )
:effect (and (at ?srv ?l2) (not(at ?srv ?l1)) (increase (total-cost) 1))
)
(:action process
:parameters (?srv - ServiceProcessor ?o - Object ?l - Location)
:precondition (and (provides ?srv processing) (heated ?o true) (loaded ?o false) (processed ?o false) (at ?o ?l) (at ?srv ?l) (status ?srv available) )
:effect (and (processed ?o true) (not(processed ?o false)) (increase (total-cost) 1))
)
(:action load1
:parameters (?srv - ServiceRobot1 ?o - Object ?l - Location)
:precondition (and (provides ?srv loading) (loaded ?o false) (movable ?o true) (at ?o ?l) (at ?srv ?l) (status ?srv available) )
:effect (and (loaded ?o true) (not(loaded ?o false)) (increase (total-cost) 1))
)
(:action unload1
:parameters (?srv - ServiceRobot1 ?o - Object ?l - Location)
:precondition (and (provides ?srv unloading) (loaded ?o true) (movable ?o true) (at ?srv ?l) (status ?srv available) )
:effect (and (loaded ?o false) (at ?o ?l) (not(loaded ?o true)) (increase (total-cost) 1))
)
(:action move1
:parameters (?srv - ServiceRobot1 ?l1 - Location ?l2 - Location)
:precondition (and (provides ?srv moving) (at ?srv ?l1) (status ?srv available) )
:effect (and (at ?srv ?l2) (not(at ?srv ?l1)) (increase (total-cost) 1))
)
(:action convert
:parameters (?srv - ServiceConverter ?o - Object ?l - Location)
:precondition (and (provides ?srv converting) (loaded ?o false) (heated ?o false) (cooled ?o false) (cooled ?o false) (at ?o ?l) (at ?srv ?l) (status ?srv available) )
:effect (and (heated ?o true) (cooled ?o true) (cooled ?o true) (not(heated ?o false)) (not(cooled ?o false)) (not(cooled ?o false)) (increase (total-cost) 1))
)

)

; problem
(define (problem myProblem)
(:domain myDomain)
(:objects 
o1 - Object
l00 - Location
l01 - Location
l02 - Location
l03 - Location
l04 - Location
l05 - Location
l06 - Location
l10 - Location
l11 - Location
l12 - Location
l13 - Location
l14 - Location
l15 - Location
l16 - Location
l20 - Location
l21 - Location
l22 - Location
l23 - Location
l24 - Location
l25 - Location
l26 - Location
l30 - Location
l31 - Location
l32 - Location
l33 - Location
l34 - Location
l35 - Location
l36 - Location
true - Boolean
false - Boolean
available - State
broken - State
cooling - Capability
heating - Capability
loading - Capability
unloading - Capability
moving - Capability
processing - Capability
converting - Capability
cooler - ServiceCooler
heater - ServiceHeater
rb2 - ServiceRobot2
processor - ServiceProcessor
rb1 - ServiceRobot1
converter - ServiceConverter
)
(:init 
(provides cooler cooling)
(provides heater heating)
(provides rb2 loading)
(provides rb2 unloading)
(provides rb2 moving)
(provides processor processing)
(provides rb1 loading)
(provides rb1 unloading)
(provides rb1 moving)
(provides converter converting)
(status cooler available)
(at cooler l22)
(status heater available)
(at heater l20)
(status rb2 available)
(at rb2 l24)
(status processor available)
(at processor l22)
(loaded o1 false)
(at o1 l00)
(movable o1 true)
(heated o1 false)
(cooled o1 false)
(processed o1 false)
(status rb1 broken)
(at rb1 l31)
(status converter available)
(at converter l03)
(= (total-cost) 0)
)
(:goal 
(and 
(at o1 l36)
(cooled o1 true)
)
)
(:metric minimize (total-cost))

)

; plan
1. (move2 rb2 l24 l00)
   deleted: (at rb2 l24)
   added: (at rb2 l00)
   goals met: 0 of 2
2. (load2 rb2 o1 l00)
   deleted: (loaded o1 false)
   added: (loaded o1 true)
   goals met: 0 of 2
3. (move2 rb2 l00 l03)
   deleted: (at rb2 l00)
   added: (at rb2 l03)
   goals met: 0 of 2
4. (unload2 rb2 o1 l03)
   deleted: (loaded o1 true)
   added: (loaded o1 false) (at o1 l03)
   goals met: 0 of 2
5. (load2 rb2 o1 l03)
   deleted: (loaded o1 false)
   added: (loaded o1 true)
   goals met: 0 of 2
6. (move2 rb2 l03 l36)
   deleted: (at rb2 l03)
   added: (at rb2 l36)
   goals met: 0 of 2
7. (unload2 rb2 o1 l36)
   deleted: (loaded o1 true)
   added: (loaded o1 false) (at o1 l36)
   goals met: 1 of 2
8. (convert converter o1 l03)
   deleted: (heated o1 false) (cooled o1 false)
   added: (heated o1 true) (cooled o1 true)
   goals met: 2 of 2
